app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "email", "event_id", "how_heard", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 19 Sep 2014 07:35:27 UTC +00:00], ["email", "paul@anka.com"], ["event_id", 1], ["how_heard", "Twitter"], ["name", "Paul"], ["updated_at", Fri, 19 Sep 2014 07:35:27 UTC +00:00]]
---
	def create
		@registration = @event.registrations.new(registration_params)
		if @registration.save